<template>
  <div>
    <div class="bg-main text-center pb-5">
      <p class="header-3 padding-main">
        การใช้งบประมาณของกรุงเทพมหานครทั้ง 7 ด้าน <br />
        ในปี 2561-2564
      </p>
      <p class="text-3 sub">(สามารถเลือกดูรายด้านได้)</p>
      <TreeMap />

      <div class="mt-5 px-5 text-left text-treemap">
        <p class="text-3">
          ส่วนใหญ่การขอใช้งบประมาณของหน่วยงานจะขอไม่เกินการจัดทำแผนพัฒนา
          แต่จะมีบางเลขที่งบประมาณที่หน่วยงานขอจะเกินตามแผนฯ
          โดยสามารถอธิบายได้ดังนี้
        </p>
        <ol type="1" class="text-3 px-3">
          <li>
            หน่วยงานแต่ละหน่วยในปีนั้นมีเป้าหมายการดำเนินการเป็นเป้าเดียวกัน
            แต่ลักษณะโครงการเป็นตามแต่ละหน่วยงานที่ต้องดำเนินการ
            ทำให้ผลรวมของงบประมาณในเป้าหมายนั้นสูงกว่าแผน
          </li>
          <li>
            เป้าหมายนั้นสำคัญและเร่งด่วน กรณีที่เป้าหมายใดสำคัญและต้องจัดการจะถูกหยิบยกขึ้นมาเป็นความสำคัญแรกและลดหลั่นกันไป
            ทำให้บางปีเป้าหมายนั้นสูงกว่าแผน
          </li>
          <li>
            ราคาและค่าแรงต่างๆมีการปรับเปลี่ยนทุกปี
            ทำให้เลขที่ของบประมาณสูงกว่างบประมาณในแผนที่วางไว้ได้
            ซึ่งในแผนพัฒนากรุงเทพมหานครเป็นแผนถูกวางระยะยาว 20 ปี
            ทำให้ส่งผลต่อตัวเลข
          </li>
        </ol>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "App",
  components: {},
  data() {
    return {};
  },
  methods: {},
};
</script>

<style lang="scss" scoped>
.bg-main {
  background: white;
}
.padding-main {
  padding: 50px 10px 0px 10px;
  margin: 0;
}
.sub {
  color: #737373;
}
.text-treemap {
  max-width: 1300px;
  margin: auto;
  font-weight: bold;
}
</style>
